tutorials/multicomponentFluid/membrane/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc heatFlux(executeControl=timeStep)

#includeFunc specieFlux(O2, schemesField=Yi_h, executeControl=timeStep)

#includeFunc specieFlux(CH4, schemesField=Yi_h, executeControl=timeStep)

#includeFunc specieFlux(N2, schemesField=Yi_h, executeControl=timeStep)

#includeFunc patchFlux
(
    name=membraneSleeveFluxes,
    patch=membraneSleeve,
    heatFlux,
    specieFlux(O2),
    specieFlux(CH4),
    specieFlux(N2)
)

#includeFunc patchFlux
(
    name=membranePipeFluxes,
    patch=membranePipe,
    heatFlux,
    specieFlux(O2),
    specieFlux(CH4),
    specieFlux(N2)
)

// ************************************************************************* //
